# Задача 1. Котешка диета
# За да са здрави котките, храненето им трябва да следва определена диета. Напишете програма,
# която изчислява котешкото процентно разпределение на макроелементите в храната за един ден
# и пресмята колко средно калории дава един грам от тази храна. Макроелементите са: мазнини, протеини и въглехидрати.
# Разполагате с общия брой калории, които котката трябва да приеме за един ден.
# Известно е, че:
#     • 1 грам мазнини = 9 калории
#     • 1 грам протеини = 4 калории
#     • 1 грам въглехидрати = 4 калории
# За да разберете колко калории дава един грам храна на котката, ще трябва да направите изчисления с реалното тегло на храната,
# тъй като тя съдържа вода. Трябва да се изчислят грамовете на мазнините, протеините и въглехидратите.
# Тяхната сума дава общото тегло на храната и от него трябва да извадим процентите вода.
# Вход:
# От конзолата се прочитат 5 реда:
#     • Процент на мазнините - цяло число в интервала [0…100]
#     • Процент на протеините - цяло число в интервала [0…100]
#     • Процент на въглехидратите - цяло число в интервала [0…100]
#     • Общ брой калории - цяло число в интервала [1000…15000]
#     • Процент на съдържанието на вода - цяло число в интервала [0…100]
# Пояснение: Когато правим подобни изчисления с проценти има голям шанс резултатът да не е цяло число!
# Изход:
# На конзолата се отпечатва 1 ред:
#     • "{calories}"
# Резултатът трябва да бъде форматиран до четвъртия знак след десетичната запетая.

percentage_fats = int(input())
percentage_proteins = int(input())
percentage_carbs = int(input())
total_calories = int(input())
percentage_water = int(input())

fats_per_gram = 9  # calories
proteins_per_gram = 4  # calories
carbs_per_gram = 4  # calories

fats = (total_calories * (percentage_fats / 100)) / fats_per_gram
proteins = (total_calories * (percentage_proteins / 100)) / proteins_per_gram
carbs = (total_calories * (percentage_carbs / 100)) / carbs_per_gram

total_grams_elements = (fats + proteins + carbs)
calories_per_gram = total_calories / total_grams_elements
water = calories_per_gram * (percentage_water / 100)
print(f"{calories_per_gram - water:.4f}")
