# Задача 2. Щанд за гривни
# Остават 5 дни до рождения ден на брата на Тереза. Тя иска да му купи подарък и решава да си направи малък щанд
# и да продава плетени гривнички с мъниста, за да събере достатъчно пари.
# Вашата задача е да напишете програма, която да изчислява сумата, която Тереза е успяла да събере
# и да даде отговор на момичето, дали тя ще може да купи подарък или не.
# Трябва да се вземат предвид нейните разходи и цената на подаръка.
# Вход
# От конзолата се четат 4 реда:
#     • Първи ред – джобните на Тереза на ден – реално число в интервала [1.00 ...100.00]
#     • Втори ред – парите, които тя печели на ден от продажби – реално число в интервала [1.00...1000.00]
#     • Трети ред – разходите на Тереза за целия период – реално число в интервала [1.00...1000.00]
#     • Четвърти ред – цената на подаръка – реално число в интервала [1.00...10000.00]
# Изход
# На конзолата да се отпечата:
#     • Ако са изработени достатъчно пари за подарък:
#         ◦ "Profit: {всички спестени пари} BGN, the gift has been purchased."
#     • Ако са изработени по-малко нужните пари:
#         ◦ "Insufficient money: {сумата, която не достига} BGN."
# Числата трябва да са форматирани до втория знак след десетичната запетая.

money_in_her_pocket = float(input())  # per day
profit_per_day = float(input())
expenses_total = float(input())
gift_price = float(input())

days_till_bday = 5
total_profit = profit_per_day * days_till_bday
total_money_in_her_pocket = money_in_her_pocket * days_till_bday
plus_total = total_profit + total_money_in_her_pocket
balance = plus_total - expenses_total

if balance >= gift_price:
    print(f"Profit: {balance:.2f} BGN, the gift has been purchased.")
else:
    diff = abs(balance - gift_price)
    print(f"Insufficient money: {diff:.2f} BGN.")
