# Задача 3. Финален конкурс
# След успешно класиране, група заминава за  финалното състезание. След представянето си всяка група получава парична награда.
# Тя зависи от: държавата, в която се е провело състезанието; броя точки, които журито е дало и сезонът,
# през който се е провело състезанието.
#     • Ако състезанието се е провело в България паричната награда се изчислява като се умножат точките по броя участниците.
#     • Ако се е провело в чужбина – се умножават броя участници по броя точки и към тях се добавя 50% от получената сума.
# От получената сума се изваждат разходите посочени в проценти спрямо сезона, през който се е провел:
#
# След завръщането си групата дарява 75% от сумата, след приспаднатите разходи, за благотворителност.
# Останалата сума се разпределя между членовете на групата.
# Да се  напише програма, която изчислява колко пари са дадени за благотворителност и колко е получил всеки един член на групата.
# Вход:
# От конзолата се четат 4 реда:
#     1. Брой танцьори – цяло число в интервала [1 … 10]
#     2. Брой точки – реално число в интервала [1.00 … 10000.00]
#     3. Сезон –  текст със следните възможности - "summer" или "winter"
#     4. Място – текст със следните възможности - "Bulgaria" или "Abroad"
# Изход:
# На конзолата се отпечатват 2 реда:
#     • Сумата, която са дали за благотворителност
# "Charity - {сума за благотворителност}"
#     • Сумата, която е получил всеки танцьор
# "Money per dancer - {сума за танцьор}"
# Сумите да бъдат форматирани до втория знак след десетичната запетая.

dancers_number = int(input())
points_number = float(input())
season = input()
place = input()
expenses = 0

money_price = 0

if place == "Bulgaria":
    money_price = dancers_number * points_number
    if season == "summer":
        money_price *= 0.95
    elif season == "winter":
        money_price *= 0.92
elif place == "Abroad":
    money_price = (dancers_number * points_number) * 1.50
    if season == "summer":
        money_price *= 0.90
    elif season == "winter":
        money_price *= 0.85

charity = money_price * 0.75
money_left = money_price * 0.25
money_per_person = money_left / dancers_number

print(f"Charity - {charity:.2f}")
print(f"Money per dancer - {money_per_person:.2f}")
