# Задача 5. Еверест
# Атанас е алпинист, чиято следваща цел е изкачването на Еверест.
# Вашата задача е да напишете програма която да следи до каква височина е достигнал Атанас и за колко дни е изкачил върха.
# Той започва изкачването си от ден първи от базов лагер, който е на 5364 метра, а самият връх е на 8848м.
# Преди всяко изкачване на определени метри, Атанас може да си почине в някой лагер и да продължи на следващия ден
# или да продължи изкачването без да спре, като максималното време, в което той може да изкачва върха е 5 дни.
# Програмата приключва при получаване на командата "END", при достигане на върха(8848м)
# или при превишаване на разрешените 5 дни за изкачване.
#
# Вход
# От конзолата се четат по два реда до въвеждане на команда "END",
# ако са минали повече от 5 дни в изкачване или се достигне върха (8848м):
#     • "Yes" / "No" - текст - дали Атанас ще нощува преди изкачването на следващите метри или не
#     • Изкачени метри - цяло число в интервала [1...4000]
#
# Изход
# След получаване на командата "END", превишаване на разрешениете 5 дни за изкачване или се достигне върха (8848м),
# на конзолата се отпечатва:
#     • Ако Атанас е изкачил Еверест:
# "Goal reached for {брой дни които Атанас е изкачвал върха} days!"
#     • Ако Атанас НЕ е изкачил Еверест:
# "Failed!"
# "{достигнатите от Атанас метри}"


days = 1
height = 5364
top_reached = False
input_line = input()

while input_line != "END":
    choice = input_line

    if height >= 8848:
        top_reached = True
        break

    if choice == "Yes":
        days += 1
        plus_height = int(input())
        height += plus_height
    elif choice == "No":
        plus_height = int(input())
        height += plus_height
    else:
        break

    if days == 5:
        break
    if height >= 8848:
        top_reached = True
        break

    input_line = input()

if top_reached:
    print(f"Goal reached for {days} days!")
else:
    print(f"Failed!")
    print(f"{height}")