# Задача 6. Смени
# Любимият отбор на Пепи е на финал, но започва да губи мача. Треньорът на отбора не знае какви смени да направи,
# за да обърне резултата.
# Напишете програма, с която ще разберете кой са първите 6 валидни смени, които могат да се направят.
# Знаем, че всяка цифра от двата номера е в даден интервал:
#     • Първата цифра на първото число е в интервала от цифрата K до 8, включително.
#     • Втората цифра на първото число е в интервала от 9 до L, включително.
#     • Първата цифра на второто число е в интервала от цифрата M до 8, включително.
#     • Втората цифра на второто число е в интервала от 9 до N, включително.
# За да бъде възможна една смяна, първата цифра на всеки от номерата трябва да бъде четна, а втората -  нечетна.
# За да бъде валидна една смяна, то номерата НЕ трябва да съвпадат.
# Вход:
# От конзолата се четат 4 реда:
#     • K – цяло число в интервала [0..8]
#     • L – цяло число в интервала [0..9]
#     • M– цяло число в интервала [0..8]
#     • N – цяло число в интервала [0..9]
# Изход:
# На конзолата да се отпечатат първите 6 валидни смени по следния начин:
#     • Ако смяната е възможна и номерата НЕ съвпадат, тя Е валидна и трябва да се отпечата:
# "{K}{L} - {M}{N}"
#     • Ако смяната е възможна, но номерата съвпадат, тя НЕ е валидна и трябва да се отпечата:
# "Cannot change the same player."
# Примерен вход и изход:

k = int(input())
l = int(input())
m = int(input())
n = int(input())

# k = 6
# l = 7
# m = 5
# n = 6
count_changes = 0
enough_changes = False

for first_one in range(k, 8 + 1):

    for first_two in range(9, l - 1, - 1):

        for second_one in range(m, 8 + 1):

            for second_two in range(9, n - 1, - 1):

                if first_one % 2 != 0 or second_one % 2 != 0:
                    pass
                elif first_two % 2 == 0 or second_two % 2 == 0:
                    pass
                elif str(first_one) + str(first_two) == str(second_one) + str(second_two):
                    print(f"Cannot change the same player.")
                else:
                    count_changes += 1
                    if count_changes <= 6:
                        print(f"{first_one}{first_two} - {second_one}{second_two}")

                    else:
                        enough_changes = True
                        break
            if enough_changes:
                break

        if enough_changes:
            break

    if enough_changes:
        break
